rottenpotatoes/app/controllers/movies_controller.rb

  def director
    @movie = Movie.find params[:id]

    if @movie.director
     # @movies.find_all_by_director(@movie.director)
     @movies =Movie.where(director: @movie.director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'